Revit 2024 API
ReferencePoint.Name Property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override string Name { get; set; }
Visual Basic
Public Overrides Property Name As String
	Get
	Set
Visual C++
public:
virtual property String^ Name {
	String^ get () override;
	void set (String^ value) override;
}
See Also
ReferencePoint Class
Autodesk.Revit.DB Namespace